MK1-Modding/MK12UProject/Source/MK12/Public/MK12MapModeBackgroundDefinition.h
#pragma once
#include "CoreMinimal.h"
#include "MK12MapModeBackgroundDefinition.generated.h"

class UMapModeEnvironmentContentDefinition;

USTRUCT(BlueprintType)
struct MK12_API FMK12MapModeBackgroundDefinition {
    GENERATED_BODY()
public:
    UPROPERTY(BlueprintReadWrite, EditAnywhere, meta=(AllowPrivateAccess=true))
    FString mStartingSplineName;
    
    UPROPERTY(BlueprintReadWrite, EditAnywhere, meta=(AllowPrivateAccess=true))
    FName mStartingSplineLevel;
    
    UPROPERTY(BlueprintReadWrite, EditAnywhere, meta=(AllowPrivateAccess=true))
    FString mStartingNavNodeName;
    
    UPROPERTY(BlueprintReadWrite, EditAnywhere, meta=(AllowPrivateAccess=true))
    int32 mStartingNavNode;
    
protected:
    UPROPERTY(BlueprintReadWrite, EditAnywhere, meta=(AllowPrivateAccess=true))
    TSoftObjectPtr<UMapModeEnvironmentContentDefinition> mEnvironment;
    
    UPROPERTY(BlueprintReadWrite, EditAnywhere, meta=(AllowPrivateAccess=true))
    FString mMesaName;
    
    UPROPERTY(BlueprintReadWrite, EditAnywhere, meta=(AllowPrivateAccess=true))
    FName mLightingScenarioName;
    
    UPROPERTY(BlueprintReadWrite, EditAnywhere, meta=(AllowPrivateAccess=true))
    FName mPathwayName;
    
public:
    FMK12MapModeBackgroundDefinition();
};

